app/controllers/plants_controller.rb

SELECT "plants".* FROM "plants"
---
  def index
    @plants = Plant.all

INSERT INTO "plants" ("name", "user_id", "image_url", "plant_type", "bloom_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @plant = Plant.new(plant_params)
    @plant.user = @current_user
    if @plant.save

UPDATE "plants" SET "bloom_time" = $1, "updated_at" = $2 WHERE "plants"."id" = $3  [["bloom_time", "wherever she is planted!"], ["updated_at", "2021-02-02 01:06:47.798200"], ["id", 2]]
---
  def update
    if @plant.update(plant_params)

DELETE FROM "plants" WHERE "plants"."id" = $1  [["id", 41]]
---
  def destroy
    @plant.destroy

SELECT "plants".* FROM "plants" WHERE "plants"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
---
    def set_plant
      @plant = Plant.find(params[:id])