app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "admin2"], ["email", "admin2@mail.com"], ["created_at", "2021-01-28 23:52:19.363583"], ["updated_at", "2021-01-28 23:52:19.363583"]]
INSERT INTO "users" ("username", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "admin"], ["email", "admin@mail.com"], ["created_at", "2021-01-28 23:45:30.727430"], ["updated_at", "2021-01-28 23:45:30.727430"]]